app/Controllers/Tienda.php

SELECT *
FROM `producto`
WHERE `destacado` = 1
AND `is_active` = 1
 LIMIT 8
SELECT *
FROM `categoria`
SELECT *
FROM `producto`
WHERE `precio_oferta` IS NOT NULL
AND `is_active` = 1
 LIMIT 4
---
    public function index()
    {
        $productoModel = new ProductoModel();
        $categoriaModel = new CategoriaModel();

        $data = [
            'title' => 'Inicio',
            'productos_destacados' => $productoModel->where('destacado', 1)
                ->where('is_active', 1)
                ->findAll(8),
            'categorias' => $categoriaModel->findAll(),
            'ofertas' => $productoModel->where('precio_oferta IS NOT NULL')
                ->where('is_active', 1)
                ->findAll(4),

SELECT *
FROM `producto`
WHERE `id_categoria` = '1'
AND `is_active` = 1
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `producto`
WHERE `id_categoria` = '1'
AND `is_active` = 1
---
    public function categoria($id)
    {
        $productoModel = new ProductoModel();
        $categoriaModel = new CategoriaModel();

        // Obtener la categoría
        $categoria = $categoriaModel->find($id);

        if (!$categoria) {
            return redirect()->to('/')->with('error', 'Categoría no encontrada');
        }

        // Obtener productos de la categoría
        $productos = $productoModel->where('id_categoria', $id)
            ->where('is_active', 1)
            ->paginate(12);

SELECT *
FROM `categoria`
---
            'title' => 'Productos',
            'productos' => $builder->paginate(12),
            'pager' => $productoModel->pager,
            'categorias' => $categoriaModel->findAll(),

SELECT *
FROM `producto`
WHERE `id_categoria` = '4'
AND `id_producto` != '21'
AND `is_active` = 1
 LIMIT 4
---
    public function producto($id)
    {
        $productoModel = new ProductoModel();
        $producto = $productoModel->find($id);

        if (!$producto) {
            return redirect()->to('/productos')->with('error', 'Producto no encontrado');
        }

        // Obtener productos relacionados
        $relacionados = $productoModel->where('id_categoria', $producto['id_categoria'])
            ->where('id_producto !=', $id)
            ->where('is_active', 1)
            ->findAll(4);