app/Controllers/Ventas.php

SELECT `venta`.*, `cliente`.`nombre` as `cliente_nombre`, `cliente`.`apellido` as `cliente_apellido`, `cliente`.`dni` as `cliente_dni`, `cliente`.`telefono` as `cliente_telefono`, `cliente`.`email` as `cliente_email`, `cliente`.`direccion` as `cliente_direccion`, `usuario`.`nombre` as `usuario_nombre`, `usuario`.`apellido` as `usuario_apellido`, `usuario`.`email` as `usuario_email`, `metodo_pago`.`nombre` as `metodo_pago_nombre`
FROM `venta`
LEFT JOIN `cliente` ON `venta`.`id_cliente` = `cliente`.`id_cliente`
LEFT JOIN `usuario` ON `venta`.`id_usuario` = `usuario`.`id_usuario`
LEFT JOIN `metodo_pago` ON `venta`.`metodo_pago_id` = `metodo_pago`.`id_metodo_pago`
ORDER BY `venta`.`fecha_venta` DESC
---
    public function index()
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        $db = \Config\Database::connect();

        // Consulta principal para obtener ventas con información del cliente y usuario
        $builder = $db->table('venta');
        $builder->select('
            venta.*,
            cliente.nombre as cliente_nombre,
            cliente.apellido as cliente_apellido,
            cliente.dni as cliente_dni,
            cliente.telefono as cliente_telefono,
            cliente.email as cliente_email,
            cliente.direccion as cliente_direccion,
            usuario.nombre as usuario_nombre,
            usuario.apellido as usuario_apellido,
            usuario.email as usuario_email,
            metodo_pago.nombre as metodo_pago_nombre
        ');
        $builder->join('cliente', 'venta.id_cliente = cliente.id_cliente', 'left');
        $builder->join('usuario', 'venta.id_usuario = usuario.id_usuario', 'left');
        $builder->join('metodo_pago', 'venta.metodo_pago_id = metodo_pago.id_metodo_pago', 'left');
        $builder->orderBy('venta.fecha_venta', 'DESC');

        $ventas = $builder->get()->getResultArray();

SELECT *
FROM `cliente`
SELECT *
FROM `metodo_pago`
SELECT *
FROM `producto`
SELECT *
FROM `categoria`
---
    public function create()
    {
        // Verificar la sesión de administrador
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to(base_url('admin/login'));
        }

        try {
            $clienteModel = new ClienteModel();
            $metodoPagoModel = new MetodoPagoModel();
            $productoModel = new ProductoModel();
            $categoriaModel = new CategoriaModel();

            $data = [
                'clientes' => $clienteModel->findAll(),
                'metodos_pago' => $metodoPagoModel->findAll(),
                'productos' => $productoModel->findAll(),
                'categorias' => $categoriaModel->findAll()
            ];

SELECT `numero_comprobante`
FROM `venta`
WHERE `tipo_comprobante` = 'boleta'
ORDER BY `id_venta` DESC
 LIMIT 1
SELECT `numero_comprobante`
FROM `venta`
WHERE `tipo_comprobante` = 'factura'
ORDER BY `id_venta` DESC
 LIMIT 1
---
    public function getLastComprobanteNumbers()
    {
        try {
            $ventaModel = new VentaModel();

            // Obtener último número de boleta
            $lastBoleta = $ventaModel->select('numero_comprobante')
                ->where('tipo_comprobante', 'boleta')
                ->orderBy('id_venta', 'DESC')
                ->limit(1)
                ->get()
                ->getRowArray();

            // Obtener último número de factura
            $lastFactura = $ventaModel->select('numero_comprobante')
                ->where('tipo_comprobante', 'factura')
                ->orderBy('id_venta', 'DESC')
                ->limit(1)
                ->get()
                ->getRowArray();